---
kind: property
id: P:Autodesk.Revit.DB.MEPCalculationServerInfo.Description
source: html/c316df8b-0063-0bd7-b5ee-1e1790c8f9fb.htm
---
# Autodesk.Revit.DB.MEPCalculationServerInfo.Description Property

The Description of the server.

## Syntax (C#)
```csharp
public string Description { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null